{
  "issues": [
    {
      "id": 1,
      "title": "Long Wait Times for Social Housing",
      "content": "I've been on the waiting list for social housing for three years now, and my family and I are still living in a small one-bedroom flat despite having two young children. The rental costs are too high, and council response has been slow. Can we get more priority, or what is being done to address this shortage?",
      "upvotes": 153,
      "user": "Sarah T.",
      "tag": "Housing",
      "comments": [
        {
          "id": 1,
          "text": "I understand your frustration. We're in a similar situation, and it's been really challenging.",
          "author": "James L.",
          "upvotes": 34
        },
        {
          "id": 2,
          "text": "I think the local government needs to prioritize housing more. It's becoming a crisis.",
          "author": "Emily R.",
          "upvotes": 27
        },
        {
          "id": 3,
          "text": "Is there any way we can escalate this collectively to make a bigger impact?",
          "author": "Michael W.",
          "upvotes": 19
        }
      ]
    },
    {
      "id": 2,
      "title": "Limited Access to Local GP Services",
      "content": "It's nearly impossible to get an appointment with a GP in our area. I've been calling every morning, but there are rarely any slots available, and I often end up waiting weeks for even a basic consultation. This is particularly worrying for families with children or elderly residents. What is being done to improve access to healthcare?",
      "upvotes": 104,
      "user": "Helen M.",
      "tag": "Healthcare",
      "comments": [
        {
          "id": 4,
          "text": "I completely agree! I've been trying to get an appointment for weeks, and it's affecting my health.",
          "author": "Tom L.",
          "upvotes": 29
        },
        {
          "id": 5,
          "text": "The healthcare system really needs to be improved. Our community deserves better.",
          "author": "Rachel C.",
          "upvotes": 24
        }
      ]
    },
    {
      "id": 3,
      "title": "Road Safety Concerns on High Street",
      "content": "The High Street has become very dangerous with cars speeding and heavy traffic, especially near the primary school. There have been multiple incidents recently, and it feels like only a matter of time before a serious accident happens. Can the council introduce speed bumps or a pedestrian crossing to ensure safety for residents and children?",
      "upvotes": 91,
      "user": "David P.",
      "tag": "Road Safety",
      "comments": [
        {
          "id": 6,
          "text": "Absolutely agree. It’s not safe for children to cross that road. Speed bumps would make a big difference.",
          "author": "Anna B.",
          "upvotes": 33
        },
        {
          "id": 7,
          "text": "We need a pedestrian crossing urgently. My kids go to that school, and I worry every day.",
          "author": "Karen W.",
          "upvotes": 28
        }
      ]
    }
  ]
}
