{
  "issues": [
    {
      "id": 1,
      "title": "Long Wait Times for Social Housing",
      "content": "I've been on the waiting list for social housing for three years now, and my family and I are still living in a small one-bedroom flat despite having two young children. The rental costs are too high, and council response has been slow. Can we get more priority, or what is being done to address this shortage?",
      "upvotes": 153,
      "user": "Sarah T.",
      "tag": "Housing",
      "comments": [
        {
          "id": 1,
          "text": "I understand your frustration. We're in a similar situation, and it's been really challenging.",
          "author": "James L.",
          "upvotes": 34
        },
        {
          "id": 2,
          "text": "I think the local government needs to prioritize housing more. It's becoming a crisis.",
          "author": "Emily R.",
          "upvotes": 27
        },
        {
          "id": 3,
          "text": "Is there any way we can escalate this collectively to make a bigger impact?",
          "author": "Michael W.",
          "upvotes": 19
        }
      ]
    },
    {
      "id": 2,
      "title": "Need for Affordable Housing Options",
      "content": "The cost of renting has skyrocketed. More affordable housing options are necessary for families. Many of us are on the verge of eviction as rents go up. What steps are being taken to address this?",
      "upvotes": 98,
      "user": "Anita K.",
      "tag": "Housing",
      "comments": [
        {
          "id": 4,
          "text": "It’s really difficult to afford rent these days. I’m worried about being priced out of my home.",
          "author": "Mark D.",
          "upvotes": 22
        },
        {
          "id": 5,
          "text": "More affordable housing should be a priority for the council. This is affecting too many people.",
          "author": "Sophia J.",
          "upvotes": 18
        }
      ]
    },
    {
      "id": 3,
      "title": "Poor Living Conditions in Council Flats",
      "content": "Our building is in disrepair, with broken elevators, leaking pipes, and no heating in common areas. Despite complaints, repairs are slow or not completed at all. This needs immediate attention.",
      "upvotes": 87,
      "user": "Brian W.",
      "tag": "Housing",
      "comments": [
        {
          "id": 6,
          "text": "We’re facing the same issues in our council block. This is unacceptable.",
          "author": "Lucy M.",
          "upvotes": 30
        },
        {
          "id": 7,
          "text": "The council really needs to step up their maintenance efforts.",
          "author": "Dylan H.",
          "upvotes": 25
        }
      ]
    }
  ]
}
